app/Models/ReportsModel.php

SELECT *
FROM `tbloffice`
WHERE `officeid` = 'all'
---
    public function get_office_name($params){
        $builder = $this->db->table('tbloffice');
        $builder->where('officeid',$params['officeid']);
        $query = $builder->get();